/*Apostolia Maria Sofianopoulou AM: iis21118

Εκφώνηση άσκησης a13f3: Να γραφεί πρόγραμμα που ζητά από τον χρήστη έναν ακέραιο Ν (όριο)
και υπολογίζει το άθροισμα των κλασμάτων ∑ x=1 Ν (1/x) , δηλαδή 1/1+1/2+1/3+…+1/Ν
(προσοχή στις μετατροπές τύπων, το άθροισμα είναι τύπου float). Θεωρείστε ότι ο χρήστης
εισάγει πάντα έναν ακέραιο μεγαλύτερο ή ίσο του 1 (δεν απαιτείται έλεγχος). Το αποτέλεσμα να εμφανιστεί με
ακρίβεια 2 δεκαδικών ψηφίων.*/

#include <stdio.h>
#include "simpio.h"

int main()
{
    int orio, i;
    float sum;

    printf("Dwse orio: ");
    orio = GetInteger();

    sum = 0;
    for (i=1; i<=orio; i++)
    {
       sum += (1.0/i);
    }

    printf("To athroisma einai: %.2f",sum);

    return 0;
}
