/*Apostolia Maria Sofianopoulou AM: iis21118

Εκφώνηση άσκησης a1af3: Να γράψετε πρόγραμμα για κάθε μία από τις παρακάτω περιπτώσεις:
a. Ο σημερινός αριθμός αυτοκινήτων που κυκλοφορούν σε μια πόλη είναι 80000. Αν ο αριθμός
αυτός αυξάνεται με ρυθμό 7%, να γραφεί πρόγραμμα που να υπολογίζει σε πόσα χρόνια ο αριθμός
των αυτοκινήτων θα ξεπεράσει τις 160000. Πόσα θα είναι τότε τα αυτοκίνητα;
b. Γενικεύστε το πρόγραμμα για Αrithmo_Αytok (long) αυτοκίνητα, που αυξάνονται με ετήσιο ρυθμό
Rythmos και ξεπερνούν ένα δοσμένο όριο Οrio (long), στοιχεία τα οποία θα εισάγει ο χρήστης.

Τα προγράμματα a και b να εμφανίζουν τα έτη (long) και τον αριθμό των αυτοκινήτων (long) όταν θα ξεπεράσει το δοσμένο όριο.
Για τον υπολογισμό του ετήσιου αριθμού αυτοκινήτων να χρησιμοποιηθεί ο τύπος:
Αριθμός αυτοκινήτων = ceil(Αριθμός αυτοκινήτων *(1+Ρυθμός αύξησης)) */

#include <stdio.h>
#include <math.h>
#include "simpio.h"
#define initial_cars 80000
#define rate 0.07
#define limit 160000

int main()
{
    long cars;
    long years;

    years = 0;
    cars = initial_cars;

    while (cars <= limit)
    {
        cars = ceil(cars*(1+rate));
        years++;
    }

    printf("%ld \n%ld", years, cars);

    return 0;

}

