/*Apostolia Maria Sofianopoulou AM: iis21118

Εκφώνηση άσκησης a23f3: Να γραφεί πρόγραμμα το οποίο ζητά από τον χρήστη έναν θετικό ακέραιο (int) (> 0)
και έπειτα αν ο ακέραιος είναι άρτιος (ζυγός) εμφανίζει στην οθόνη την αύξουσα ακολουθία του αριθμού από το 0 με βήμα 2,
ενώ αν ο ακέραιος είναι περιττός (μονός) εμφανίζει στην οθόνη την αύξουσα ακολουθία του αριθμού από το 1 με βήμα 2.
Θεωρείστε ότι ο χρήστης θα δώσει πάντα ένα θετικό ακέραιο (δεν απαιτείται έλεγχος). */

#include <stdio.h>
#include "simpio.h"

int main()
{
    int number, x;

    printf("Enter number:");
    number=GetInteger();

    if (number%2==0)
    {
        for(x=0;x<=number;x+=2)
        {
            printf("%d ",x);
        }
    }
    else if (number%2!=0)
    {
        for(x=1;x<=number;x+=2)
        {
            printf("%d ",x);
        }
    }
    return 0;
}
