/*Apostolia Maria Sofianopoulou AM: iis21118

Εκφώνηση άσκησης a6f6:
Να γραφεί ένα πρόγραμμα το οποίο εμφανίζει μέσους όρους σωματομετρικών στοιχείων μιας ομάδας Ν ατόμων (το Ν είναι “σταθερά”
και καθορίζεται με αντίστοιχη εντολή define). Για την υποβολή της άσκησης μπορείτε να θέσετε το Ν ίσο με 5.

Το πρόγραμμα θα εκτελεί τις παρακάτω λειτουργίες με τη χρήση συναρτήσεων:

a. Θα διαβάζει Ν τετράδες ακέραιων αριθμών (σωματομετρικά στοιχεία)
και θα τους καταχωρεί σε διδιάστατο πίνακα (συνάρτηση readData). Κάθε τετράδα αναφέρεται στα στοιχεία ενός ατόμου, που είναι κατά σειρά τα εξής:
 το φύλο (0 αν είναι άνδρας, 1 αν είναι γυναίκα)
 το βάρος (σε κιλά, ακέραια τιμή)
 το ύψος (σε εκατοστά, ακέραια τιμή)
 η ηλικία (σε χρόνια, ακέραια τιμή)

b. Θα εμφανίζει το μέσο όρο του βάρους, του ύψους και της ηλικίας τόσο για τους άνδρες όσο και για τις γυναίκες. Ο υπολογισμός (και όχι η εμφάνιση)
του μέσου όρου για κάθε ένα στοιχείο (ύψος, βάρος ηλικία) θα γίνεται με τη βοήθεια μιας (και μόνο) συνάρτησης void FindMean. Εκτός των άλλων παραμέτρων
που θα ορίσετε στη συνάρτηση, αυτή θα έχει ως παράμετρο και έναν αριθμοδείκτη (τιμές 1, 2, 3). Ο αριθμοδείκτης θα δείχνει το αντίστοιχο στοιχείο της
τετράδας, του οποίου ο μέσος όρος υπολογίζεται στη συγκεκριμένη κλήση, δηλαδή τη κατάλληλη στήλη του διδιάστατου πίνακα. Για παράδειγμα, όταν ο
αριθμοδείκτης είναι 1, τότε θα υπολογίζεται ο μέσος όρος του βάρους. Η συνάρτηση FindMean σε κάθε κλήση της θα «επιστρέφει» συγχρόνως τον αντίστοιχο
μέσο όρο για τους άνδρες και τον αντίστοιχο μέσο όρο για τις γυναίκες, θα «επιστρέφει» δηλαδή 2 τιμές. (δείτε παρατήρηση 5 για τον όρο «επιστρέφει»).
Στη συνάρτηση main() θα καλούνται κατάλληλα οι παραπάνω συναρτήσεις/διαδικασίες προκειμένου να διαβαστούν τα δεδομένα και στη συνέχεια να εμφανιστούν
οι μέσοι όροι του βάρους, του ύψους και της ηλικίας των ανδρών και των γυναικών. Οι μέσοι όροι θα εμφανίζονται με ακρίβεια ενός δεκαδικού ψηφίου. */

#include <stdio.h>
#include "simpio.h"

#define N 5

void readData(int array[N][4]);
void FindMean(int array[N][4], int pointer, float *p0, float *p1);

int main()
{
    int array[N][4];
    float p0,p1;

    readData(array);
    FindMean(array, 1, &p0, &p1);
    printf("Mesos oros barous andrwn: %.1f\n", p0);
    printf("Mesos oros barous gynaikwn: %.1f\n\n", p1);
    FindMean(array, 2, &p0, &p1);
    printf("Mesos oros ypsous andrwn: %.1f\n", p0);
    printf("Mesos oros ypsous gynaikwn: %.1f\n\n", p1);
    FindMean(array, 3, &p0, &p1);
    printf("Mesos oros hlikias andrwn: %.1f\n", p0);
    printf("Mesos oros hlikias gynaikwn: %.1f\n\n", p1);

    return 0;
    system("PAUSE");
}

void readData(int array[N][4])
{
    int i;
    for(i=0;i<N;i++)
    {
        printf("Dwse fylo: ");
        array[i][0]=GetInteger();
        printf("Dwse baros: ");
        array[i][1]=GetInteger();
        printf("Dwse ypsos: ");
        array[i][2]=GetInteger();
        printf("Dwse ilikia: ");
        array[i][3]=GetInteger();
        printf("-----\n");
    }
}

void FindMean(int array[N][4], int pointer, float *p0, float *p1)
{
    int i;
    float sum0, sum1, num0, num1;
    sum0=sum1=num0=num1=0;
    *p0=*p1=0;

    for(i=0;i<N;i++)
    {
        if((array[i][0]==0))
            {sum0+=array[i][pointer];
            num0++;
            *p0=sum0/num0;}
        else
            {sum1+=array[i][pointer];
            num1++;
            *p1=sum1/num1;}
    }
}
