/*Apostolia Maria Sofianopoulou AM: iis21118

Εκφώνηση άσκησης a29f4: Υλοποιείστε τις αντίστοιχες συναρτήσεις στην γλώσσα C των ακόλουθων μαθηματικών ορισμών:
• Ο μέγιστος κοινός διαιρέτης (gdc) δύο μη αρνητικών ακεραίων δίνεται από τον ακόλουθο αναδρομικό ορισμό:
    gcd(a,b)={a, εάν b=0
              gcd(b,a%b), αλλιώς}
• Δυο ακέραιοι αριθμοί λέγονται σχετικά πρώτοι (coprime) αν ο μέγιστος κοινός διαιρέτης τους είναι το 1.
• Η συνάρτηση φ του Euler (phi) ενός θετικού ακεραίου Ν είναι το πλήθος των θετικών ακεραίων αριθμών μικρότερων ή ίσων του Ν,
οι οποίοι είναι σχετικά πρώτοι με το Ν (δηλαδή οι ακέραιοι Κ με 1 <= Κ <= Ν).

Να υλοποιήσετε ένα πρόγραμμα σε C, το οποίο ζητά από τον χρήστη ένα ακέραιο Χ και εμφανίζει τις τιμές της συνάρτησης φ του Euler
από το 1 μέχρι και τον αριθμό X. Θεωρείστε ότι ο χρήστης δίνει πάντα αριθμό μεγαλύτερο ή ίσο του 1 - δεν απαιτείται έλεγχος.
Η εμφάνιση των μηνυμάτων θα γίνεται μέσω του κυρίως προγράμματος (συνάρτηση main(), δηλαδή η εντολή εμφάνισης των μηνυμάτων (printf) θα είναι στην main()). */

#include <stdio.h>
#include "simpio.h"

int gcd(int a,int b);
bool coprime(int a,int b);
int Euler(int x);


int main()
{
    int X,i;
    printf("Enter X:");
    X = GetInteger();

    for(i=1;i<=X;i++)
        printf("phi(%d) = %d\n",i,Euler(i));

    return 0;
}

int gcd(int a,int b)
{
    if ((b==0)) return a;
    return gcd(b,a%b);
}

bool coprime(int a,int b)
{
    if (gcd(a,b)==1) return TRUE;
    return FALSE;
}

int Euler(int x)
{
    int sum,y;
    sum=0;
    for(y=1;y<=x;y++)
        if (coprime(x,y))
        sum+=1;
    return sum;
}



